src/СРМ/src/DataProcessors/ФормированиеОтчетовПоРаботеПартнерам/ФормированиеОтчетовПоРаботеПартнерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормированиеОтчетовПоРаботеПартнерам</name>
</mdclass:DataProcessor>

src/СРМ/src/AccumulationRegisters/Трудозатраты/Трудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Трудозатраты</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Факт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>План</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Предмет</name>
    <type>
      <types>DefinedType.ПредметУчетаТрудозатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/СРМ/src/Enums/ВидыСтатусовЗадач/ВидыСтатусовЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтатусовЗадач</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
</mdclass:Enum>

src/СРМ/src/Documents/Задача/Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Задача</name>
  <basedOn>Document.Задача</basedOn>
  <registerRecords>AccumulationRegister.Трудозатраты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботПоЗадаче</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактОбращения</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаТрудозатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаТрудозатратИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Редактор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскаяЗадача</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Спринт</name>
    <type>
      <types>DocumentRef.Спринт</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияАвто</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Срочность</name>
    <type>
      <types>CatalogRef.СрочностиЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>CatalogRef.ВидыОплатыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеФормат</name>
    <type>
      <types>EnumRef.ВариантыОформленияТекста</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗакрытия</name>
    <type>
      <types>CatalogRef.КатегорииЗакрытияЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтправки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/СРМ/src/Catalogs/СтатусыЗадач/СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыЗадач</name>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыСтатусовЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Редактор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинкиПрогресса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/СРМ/src/DataProcessors/ФормированиеОтчетовПоРаботеПартнерам/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСтатусыПоУмолчанию();
	ЗаполнитьДеревоЗадач();
	УстановитьУсловноеОформлениеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗначенияДляВыбора = УправлениеЗадачамиПовтИсп.УпорядоченныйСписокСтатусов();
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Отмеченные", Статусы);
	ПараметрыОткрытия.Вставить("ОписаниеТипов", Новый ОписаниеТипов("СправочникСсылка.СтатусыЗадач"));
	ПараметрыОткрытия.Вставить("ЗначенияДляВыбора", ЗначенияДляВыбора);
	ПараметрыОткрытия.Вставить("ЗначенияДляВыбораЗаполнены", Элемент.СписокВыбора.Количество() > 0);
//	ПараметрыОткрытия.Вставить("ОграничиватьВыборУказаннымиЗначениями", ПараметрыОткрытия.ЗначенияДляВыбораЗаполнены);
	ПараметрыОткрытия.Вставить("Представление", Элемент.Заголовок);
//	ПараметрыОткрытия.Вставить("ПараметрыВыбора", Новый Массив(С));
	ПараметрыОткрытия.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	
	Обработчик = Новый ОписаниеОповещения("СтатусыНачалоВыбораЗавершение", ЭтотОбъект);
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОткрытьФорму("ОбщаяФорма.ВводЗначенийСпискомСФлажками", ПараметрыОткрытия, ЭтотОбъект,,,, Обработчик, Режим);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадачи

&НаКлиенте
Процедура ЗадачиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекДанные = Элементы.Задачи.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Задачи.ТекущийЭлемент = Элементы.ЗадачиПометка Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.Изменено = Истина;
	ТекДанные.Пометка = Истина;
	ЗадачиПометкаПриИзмененииНаСервере(ТекДанные.ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПометкаПриИзменении(Элемент)
	ЗадачиПометкаПриИзмененииНаСервере(Элементы.Задачи.ТекущаяСтрока);
КонецПроцедуры


&НаКлиенте
Процедура ЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтрокаТЧ = Задачи.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ЗадачиНомер" Тогда
		ПоказатьЗначение(Новый ОписаниеОповещения, СтрокаТЧ.Задача);
	ИначеЕсли Поле.Имя = "ЗадачиФактическиеТрудозатраты" Тогда 
		УправлениеЗадачамиКлиент.ОткрытьТрудозатратыПоЗадаче(СтрокаТЧ.Задача);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьСписокЗадач(Команда)
	ЗаполнитьДеревоЗадач();
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИзмененияЗадач(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	ПрименитьИзмененияЗадачНаСервере();
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПометкуПодчиненныхСтрок(ТекущаяСтрока, Пометка)
	Для Каждого СтрокаТЧ ИЗ ТекущаяСтрока.ПолучитьЭлементы() Цикл
		УстановитьПометкуПодчиненныхСтрок(СтрокаТЧ, Пометка);
		
		СтрокаТЧ.Пометка = Пометка;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьПометкуРодительскихЭлементов(ТекущаяСтрока)
	Родитель = ТекущаяСтрока.ПолучитьРодителя();
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ЕстьПометка = Ложь;
	Для Каждого Стр ИЗ Родитель.ПолучитьЭлементы() Цикл
		Если Стр.Пометка Тогда
			ЕстьПометка = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Родитель.Пометка = ЕстьПометка;
	
	УстановитьПометкуРодительскихЭлементов(Родитель);
КонецПроцедуры


&НаСервере
Процедура ЗадачиПометкаПриИзмененииНаСервере(ТекущаяСтрока)
	СтрокаТЧ = Задачи.НайтиПоИдентификатору(ТекущаяСтрока);
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;

	УстановитьПометкуПодчиненныхСтрок(СтрокаТЧ, СтрокаТЧ.Пометка);
	УстановитьПометкуРодительскихЭлементов(СтрокаТЧ);
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗадачуВДанныеДляОтчетовПоРаботам(СтрокаДерева, СоответствиеДанныхОтчетовПоРаботам)
	СтрокиПоПартнеру = СоответствиеДанныхОтчетовПоРаботам[СтрокаДерева.Партнер];
	Если СтрокиПоПартнеру = Неопределено Тогда
		СоответствиеДанныхОтчетовПоРаботам.Вставить(СтрокаДерева.Партнер, Новый Массив);
		СтрокиПоПартнеру = СоответствиеДанныхОтчетовПоРаботам[СтрокаДерева.Партнер];
	КонецЕсли;	
	
	СтрокиПоПартнеру.Добавить(СтрокаДерева.ПолучитьИдентификатор());
КонецПроцедуры

&НаСервере
Процедура ПрименитьИзмененияЗадачи(СтрокаДерева, СоответствиеДанныхОтчетовПоРаботам)
	Если СтрокаДерева.Изменено Тогда
		ЗадачаОбъект = СтрокаДерева.Задача.ПолучитьОбъект();

		ПоляИзменяемые = Новый Массив;
		ПоляИзменяемые.Добавить("Тема");
		ПоляИзменяемые.Добавить("КонтактОбращения");
		ПоляИзменяемые.Добавить("ВидОплаты");
		ПоляИзменяемые.Добавить("Статус");
		ПоляИзменяемые.Добавить("ОценкаТрудозатрат");
		ПоляИзменяемые.Добавить("Исполнитель");
		ПоляИзменяемые.Добавить("Спринт");
		ПоляИзменяемые.Добавить("КатегорияЗакрытия");

		ЗаполнитьЗначенияСвойств(ЗадачаОбъект, СтрокаДерева, СтрСоединить(ПоляИзменяемые, ","));

		Попытка
			ЗадачаОбъект.Записать();
			СтрокаДерева.Изменено = Ложь;

			ЗаполнитьЗначенияСвойств(СтрокаДерева, ЗадачаОбъект, "ДатаВыполнения,ДатаЗакрытия");

		Исключение
			Сообщить("Не удалось обновить данные по задаче " + ЗадачаОбъект + ": " + ОписаниеОшибки());
			Возврат;
		КонецПопытки;
	КонецЕсли;

	ДобавитьЗадачуВДанныеДляОтчетовПоРаботам(СтрокаДерева, СоответствиеДанныхОтчетовПоРаботам);

КонецПроцедуры

&НаСервере
Процедура ПрименитьИзмененияПоДеревуЗадач(Дерево, СоответствиеДанныхОтчетовПоРаботам)
	Для Каждого СтрокаТЧ Из Дерево.ПолучитьЭлементы() Цикл
		Если Не СтрокаТЧ.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТЧ.Уровень<>2 Тогда
			ПрименитьИзмененияПоДеревуЗадач(СтрокаТЧ, СоответствиеДанныхОтчетовПоРаботам);
		Иначе
			ПрименитьИзмененияЗадачи(СтрокаТЧ, СоответствиеДанныхОтчетовПоРаботам);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетыПоРаботе(СоответствиеДанныхОтчетовПоРаботам)
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьИзмененияЗадачНаСервере()
	СоответствиеДанныхОтчетовПоРаботам = Новый Соответствие;
	
	ПрименитьИзмененияПоДеревуЗадач(Задачи, СоответствиеДанныхОтчетовПоРаботам);
	СформироватьОтчетыПоРаботе(СоответствиеДанныхОтчетовПоРаботам);
	
КонецПроцедуры


&НаСервере
Процедура УстановитьУсловноеОформлениеФормы()
	УсловноеОформление.Элементы.Очистить();
	
	// Уровень исполнителя
	НовыйЭлементОформления = УсловноеОформление.Элементы.Добавить();
	НовыйЭлементОформления.Использование = Истина;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НовыйЭлементОформления.Отбор, "Задачи.Уровень", 0);
	НовыйЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);	

	ДобавитьПолеОформления(НовыйЭлементОформления, "ЗадачиНомер");
	ДобавитьПолеОформления(НовыйЭлементОформления, "ЗадачиТема");
	ДобавитьПолеОформления(НовыйЭлементОформления, "ЗадачиПартнер");
	ДобавитьПолеОформления(НовыйЭлементОформления, "ЗадачиПроект");
	
	// Уровень проект
	НовыйЭлементОформления = УсловноеОформление.Элементы.Добавить();
	НовыйЭлементОформления.Использование = Истина;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НовыйЭлементОформления.Отбор, "Задачи.Уровень", 1);
	НовыйЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);	

	ДобавитьПолеОформления(НовыйЭлементОформления, "ЗадачиНомер");
	ДобавитьПолеОформления(НовыйЭлементОформления, "ЗадачиТема");
	ДобавитьПолеОформления(НовыйЭлементОформления, "ЗадачиПартнер");
	ДобавитьПолеОформления(НовыйЭлементОформления, "ЗадачиИсполнитель");
	
	// Измененные строки
	НовыйЭлементОформления = УсловноеОформление.Элементы.Добавить();
	НовыйЭлементОформления.Использование = Истина;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НовыйЭлементОформления.Отбор, "Задачи.Изменено", Истина);
	НовыйЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗолотистый);	

	ДобавитьПолеОформления(НовыйЭлементОформления, "Задачи");
	
	//Разрешаем редактировать только уровень задач
	НовыйЭлементОформления = УсловноеОформление.Элементы.Добавить();
	НовыйЭлементОформления.Использование = Истина;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НовыйЭлементОформления.Отбор, "Задачи.Уровень", 2,
		ВидСравненияКомпоновкиДанных.НеРавно);
	НовыйЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	ДобавитьПолеОформления(НовыйЭлементОформления, "Задачи");
	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеОформления(ЭлементОформления, ИмяПоля)
	НовоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	НовоеПоле.Использование = Истина;
	НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоЗадач()
	Задачи.ПолучитьЭлементы().Очистить();
	
	ЗАпрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	Задача.Ссылка КАК Задача,
	|	Задача.Исполнитель КАК Исполнитель,
	|	Задача.ОценкаТрудозатрат КАК ОценкаТрудозатрат,
	|	Задача.ВидОплаты КАК ВидОплаты,
	|	Задача.КонтактОбращения КАК КонтактОбращения,
	|	Задача.Проект КАК Проект,
	|	Задача.Спринт КАК Спринт,
	|	Задача.Статус КАК Статус,
	|	Задача.Тема КАК Тема,
	|	Задача.КатегорияЗакрытия КАК КатегорияЗакрытия,
	|	Задача.Номер КАК Номер,
	|	Задача.ДатаЗакрытия КАК ДатаЗакрытия,
	|	Задача.ДатаВыполнения КАК ДатаВыполнения,
	|	Задача.Проект.Партнер КАК Партнер,
	|	ЕСТЬNULL(ТрудозатратыОбороты.ФактОборот, 0) КАК ФактическиеТрудозатраты
	|ИЗ
	|	Документ.Задача КАК Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Трудозатраты.Обороты КАК ТрудозатратыОбороты
	|		ПО Задача.Ссылка = ТрудозатратыОбороты.Предмет
	|ГДЕ
	|	Задача.Статус В (&Статусы)
	|	И (Задача.ДатаЗакрытия >= &ДатаНачалаУчета
	|	ИЛИ Задача.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
	|ИТОГИ
	|ПО
	|	Исполнитель,
	|	Проект";
	Запрос.УстановитьПараметр("ДатаНачалаУчета", Константы.ДатаНачалаФормированияОтчетовПоРаботамПартнерам.Получить());
	Запрос.УстановитьПараметр("Статусы",Статусы);
	
	ВыборкаИсполнитель=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИсполнитель.Следующий() ЦИкл
		СтрокаИсполнитель=Задачи.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаИсполнитель,ВыборкаИсполнитель);
		СтрокаИсполнитель.Уровень = 0;
		
		ВыборкаПроект = ВыборкаИсполнитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПроект.Следующий() Цикл
			СтрокаПроект = СтрокаИсполнитель.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПроект, ВыборкаПроект);
			СтрокаПроект.Уровень = 1;
			
			Выборка = ВыборкаПроект.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка.Следующий() Цикл
				НС = СтрокаПроект.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(НС, Выборка);
				НС.Уровень = 2;
			КонецЦикла;	
		КонецЦикла;
	КонецЦикла;		
КонецПроцедуры




&НаСервере
Процедура ЗаполнитьСтатусыПоУмолчанию()
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	СтатусыЗадач.Ссылка,
	|	СтатусыЗадач.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	|	СтатусыЗадач.Наименование КАК Наименование
	|ИЗ
	|	Справочник.СтатусыЗадач КАК СтатусыЗадач
	|ГДЕ
	|	СтатусыЗадач.Вид В (&Вид)
	|	И НЕ СтатусыЗадач.ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитДопУпорядочивания,
	|	Наименование";
	ВидыСтатусов = Новый Массив;
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовЗадач.Выполнена);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовЗадач.Закрыта);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовЗадач.Отклонена);
	Запрос.УстановитьПараметр("Вид", ВидыСтатусов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Статусы.Добавить(Выборка.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СтатусыНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Статусы.Очистить();
	Для Каждого Элемент Из Результат Цикл
		Если Не Элемент.Пометка	Тогда
			Продолжить;
		КонецЕсли;
		
		Статусы.Добавить(Элемент.Значение);
	КонецЦикла;

	ЗаполнитьДеревоЗадач();
КонецПроцедуры

#КонецОбласти
